<mark>Hello Python - 在 Anaconda 中打开 Jupyter Notebook，打印出 Hello Python

In [1]:
print('Hello Python')

Hello Python

<mark>import - 载入 numpy 及 pandas，并命名为 np 与 pd

In [2]:
import numpy as np
import pandas as pd

<mark>Series - 仿照示例创建包含如下元素的 Series 对象：2,4,6,8,10,np.nan

In [3]:
s = pd.Series([2,4,6,8,10,np.nan])#Series中可以有不同类型元素，这里因为np.nan是float类型，所以整个series的dtype也是float
s

0     2.0
1     4.0
2     6.0
3     8.0
4    10.0
5     NaN
dtype: float64

<mark>DataFrame - 按照示例创建 DataFrame 对象（两个）

In [4]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))#list('abcd')=['a','b','c','d']
df

                   A         B         C         D
2013-01-01 -1.078035  0.664507 -0.483251 -0.233995
2013-01-02  1.825398 -0.676149  1.026701  0.370410
2013-01-03  0.431576  0.690820 -0.203114  0.233426
2013-01-04 -1.105602 -0.150827 -1.055863 -0.637589
2013-01-05  1.492171 -0.947391  0.767862  2.633823
2013-01-06 -0.259890  0.078601 -1.161370 -0.408619

In [6]:
df2 = pd.DataFrame({'A': 1.,#等于该列全部赋值1.0
                    'B': pd.Timestamp('20130102'),#等于该列全部赋值Timestamp'20130102'
                    #arrays must all be same length。series全部赋值1
                    #其中range()返回range类型，等差数列，在本行代码中去作用是确定Serie的长度，不能去掉
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),#list*4=list重复4次
                    'E': pd.Categorical(["test", "train", "test", "train"]),#arrays must all be same length。类别数据，有限取值，大量重复
                    #写法2：pd.Series(["test", "train", "test", "train"], dtype='category')
                    'F': 'foo'})#等于该列全部赋值'foo'
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

<mark>dtype - 按照示例查看 DataFrame 的数据类型<p>
<mark>TAB - 延续昨日的操作，在输入 df2. 后按下 tab 键（在键盘上数下第三行左一），会出现可供使用的函数。请使用此功能查看 df2 的 index。（提示：完整代码为 df2.index 。你可以输入 df2.in 之后按下 tab 键，在看到选择框后使用键盘上的方向键（在键盘右下区域）选择需要的函数，选中后按回车键） Viewing data

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

<mark>head - 仿照示例查看 df 前 4 行

In [8]:
df.head(4)#Number of rows to select.default 5

                   A         B         C         D
2013-01-01 -1.078035  0.664507 -0.483251 -0.233995
2013-01-02  1.825398 -0.676149  1.026701  0.370410
2013-01-03  0.431576  0.690820 -0.203114  0.233426
2013-01-04 -1.105602 -0.150827 -1.055863 -0.637589

<mark>tail - 仿照示例查看 df 末 4 行

In [9]:
df.tail(4)

                   A         B         C         D
2013-01-03  0.431576  0.690820 -0.203114  0.233426
2013-01-04 -1.105602 -0.150827 -1.055863 -0.637589
2013-01-05  1.492171 -0.947391  0.767862  2.633823
2013-01-06 -0.259890  0.078601 -1.161370 -0.408619

<mark>index - 按照示例查看 df 的 index

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

<mark>columns - 按照示例查看 df 的 columns

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

<mark>to_numpy - 按照示例将 df 转为 numpy 格式。请注意当列的数据类型不同时，to_numpy 的效率将变得很低。

In [12]:
df.to_numpy()

array([[-1.07803467,  0.66450718, -0.48325069, -0.23399515],
       [ 1.8253978 , -0.67614872,  1.02670099,  0.37040975],
       [ 0.43157628,  0.69081968, -0.20311434,  0.23342578],
       [-1.10560158, -0.15082714, -1.05586268, -0.637589  ],
       [ 1.49217115, -0.94739087,  0.76786223,  2.63382329],
       [-0.25989038,  0.07860126, -1.16136953, -0.40861889]])

In [13]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

<mark>describe - 按照示例查看 df 的描述性统计

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.217603 -0.056740 -0.184839  0.326243
std    1.258003  0.675742  0.914018  1.193177
min   -1.105602 -0.947391 -1.161370 -0.637589
25%   -0.873499 -0.544818 -0.912710 -0.364963
50%    0.085843 -0.036113 -0.343183 -0.000285
75%    1.227022  0.518031  0.525118  0.336164
max    1.825398  0.690820  1.026701  2.633823

<mark>T - 按照示例查看 df 的转置

In [15]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.078035    1.825398    0.431576   -1.105602    1.492171   -0.259890
B    0.664507   -0.676149    0.690820   -0.150827   -0.947391    0.078601
C   -0.483251    1.026701   -0.203114   -1.055863    0.767862   -1.161370
D   -0.233995    0.370410    0.233426   -0.637589    2.633823   -0.408619

<mark>sort_index - 仿照示例将 df 按照 index （日期）从近到远排列。

In [16]:
df.sort_index()

                   A         B         C         D
2013-01-01 -1.078035  0.664507 -0.483251 -0.233995
2013-01-02  1.825398 -0.676149  1.026701  0.370410
2013-01-03  0.431576  0.690820 -0.203114  0.233426
2013-01-04 -1.105602 -0.150827 -1.055863 -0.637589
2013-01-05  1.492171 -0.947391  0.767862  2.633823
2013-01-06 -0.259890  0.078601 -1.161370 -0.408619

In [17]:
df.sort_index(axis=1, ascending=False)#默认0按index排序，1为按column，默认ascending=True正序，返回新对象，原df不变

                   D         C         B         A
2013-01-01 -0.233995 -0.483251  0.664507 -1.078035
2013-01-02  0.370410  1.026701 -0.676149  1.825398
2013-01-03  0.233426 -0.203114  0.690820  0.431576
2013-01-04 -0.637589 -1.055863 -0.150827 -1.105602
2013-01-05  2.633823  0.767862 -0.947391  1.492171
2013-01-06 -0.408619 -1.161370  0.078601 -0.259890

<mark>sort_values - 仿照示例将 df 按照 A,B 两列从大到小排列。

In [18]:
#sort_index的by参数已经禁用，改为sort_values
#by接收str or list of str，不能为索引值
#返回新对象，原df不变
df.sort_values(by=['A','B'],ascending=False)

                   A         B         C         D
2013-01-02  1.825398 -0.676149  1.026701  0.370410
2013-01-05  1.492171 -0.947391  0.767862  2.633823
2013-01-03  0.431576  0.690820 -0.203114  0.233426
2013-01-06 -0.259890  0.078601 -1.161370 -0.408619
2013-01-01 -1.078035  0.664507 -0.483251 -0.233995
2013-01-04 -1.105602 -0.150827 -1.055863 -0.637589

<mark>[] - 仿照示例获取 df 的 B 列（提示：英文单引号和英文双引号效果相同，选择一种使用即可）

In [19]:
df['B']#equivalent to df.A,[‘列名称’]，只能一个不可为list

2013-01-01    0.664507
2013-01-02   -0.676149
2013-01-03    0.690820
2013-01-04   -0.150827
2013-01-05   -0.947391
2013-01-06    0.078601
Freq: D, Name: B, dtype: float64

<mark>. - 仿照示例获取 df 的 C 列

In [20]:
df.C#效果同上，对于int类型的列名称，不能用df.列名称代替，只有字符串可以

2013-01-01   -0.483251
2013-01-02    1.026701
2013-01-03   -0.203114
2013-01-04   -1.055863
2013-01-05    0.767862
2013-01-06   -1.161370
Freq: D, Name: C, dtype: float64

<mark>[index_rank : index_rank] - 仿照示例查看 df 的 0 至 4 行（不含），也就是数学区间的[0,4)行

In [21]:
df[0:4]#行切片，数字代表序号，从0开始，选取index_rank时为前闭后开区间

                   A         B         C         D
2013-01-01 -1.078035  0.664507 -0.483251 -0.233995
2013-01-02  1.825398 -0.676149  1.026701  0.370410
2013-01-03  0.431576  0.690820 -0.203114  0.233426
2013-01-04 -1.105602 -0.150827 -1.055863 -0.637589

<mark>[index_value : index_value] - 仿照示例查看 df 的 20130103 至 20130106（含），也就是数学区间的[20130103,20130106]行

In [22]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [23]:
df[dates[2]:dates[5]]#行切片，选取index_value时为闭区间，如果index为int，不能采用此格式，会识别为序号

                   A         B         C         D
2013-01-03  0.431576  0.690820 -0.203114  0.233426
2013-01-04 -1.105602 -0.150827 -1.055863 -0.637589
2013-01-05  1.492171 -0.947391  0.767862  2.633823
2013-01-06 -0.259890  0.078601 -1.161370 -0.408619

In [24]:
df['20130103':'20130106':2]

                   A         B         C         D
2013-01-03  0.431576  0.690820 -0.203114  0.233426
2013-01-05  1.492171 -0.947391  0.767862  2.633823

<mark>loc - 仿照示例获取 df 的 3 行，即 dates[3] 。(提示：index 的 label 为 date）

In [25]:
df.loc[dates[3]]#loc（index切片,column切片）,只能用index和column，不能用序号，用序号是iloc

A   -1.105602
B   -0.150827
C   -1.055863
D   -0.637589
Name: 2013-01-04 00:00:00, dtype: float64

<mark>loc - 仿照示例获取 df 的 A,C 列。

In [26]:
df.loc[::2, ['A', 'C']]

                   A         C
2013-01-01 -1.078035 -0.483251
2013-01-03  0.431576 -0.203114
2013-01-05  1.492171  0.767862

<mark>loc - 仿照示例获取 df 20130103 至 20130106 行的 A,C 列。

In [27]:
df.loc['20130103':'20130106', ['A', 'C']]

                   A         C
2013-01-03  0.431576 -0.203114
2013-01-04 -1.105602 -1.055863
2013-01-05  1.492171  0.767862
2013-01-06 -0.259890 -1.161370

<mark>用法总结<p>
<mark>一般来说使用 loc 时，需要在方括号里填入行或列的 label，通俗地讲，就是行、列的名字。具体在本例中，就是 dates[3],20130103 (行的名字） 以及 A,C （列的名字）。<p>
<mark>如果我们把 index label 简写为 indexl，下标 i,j=0,1,……,N−1，N 为行数，且 i<j<p>
<mark>column label 简写为 columnl，下标 k,l=0,1,……,M−1，M 为列数，且 k<l<p>
<mark>那么对于连续的切片：<p>
<mark>df.loc[indexli:indexlj,columnlk:columnll]<p>
<mark>对于离散的切片：<p>
<mark>df.loc[[indexli,indexlj],[columnlk,columnll]]<p>
<mark>对于行连续、列离散的切片(行离散、列连续同理）：<p>
<mark>df.loc[indexli:indexlj,[columnlk,columnll]]
    
<mark><font color=red size=4 face=雅黑>loc为闭区间，iloc为左闭右开区间

<mark>at - 仿照示例获取 df 的 3 行 C 列

In [28]:
df.loc[dates[2], 'C']

-0.20311434029072153

In [29]:
df.at[dates[2], 'C']#Similar to loc，据说速度快

-0.20311434029072153

<mark>iloc - 仿照示例使用 iloc 获取 df 的 3 行

In [30]:
df.iloc[0:3]#loc（index切片,column切片）,只能用序号，左闭右开区间

                   A         B         C         D
2013-01-01 -1.078035  0.664507 -0.483251 -0.233995
2013-01-02  1.825398 -0.676149  1.026701  0.370410
2013-01-03  0.431576  0.690820 -0.203114  0.233426

In [31]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.105602 -0.150827
2013-01-05  1.492171 -0.947391

In [32]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  1.825398  1.026701
2013-01-03  0.431576 -0.203114
2013-01-05  1.492171  0.767862

In [33]:
df.iloc[1, 1]

-0.6761487246090627

In [34]:
df.iat[1, 1]#equivalent to the prior method

-0.6761487246090627

<mark>创建一个10行8列的随机数矩阵命名为 df3，其中列名为 ABCDEFGH

In [35]:
df3=pd.DataFrame(np.random.randn(10, 8),columns=list('ABCDEFGH'))
df3

,A,B,C,D,E,F,G,H
0,0.712962,0.728432,-0.590125,-0.093031,-0.917682,-0.500919,-0.116574,0.388894
1,-0.779034,0.152999,-0.222855,1.087092,-2.326493,0.952445,-1.138827,-0.745230
2,0.546075,0.017931,0.568044,0.682892,-0.409111,1.247741,-0.264636,-0.824967
3,0.580442,-0.718095,-0.115539,-0.729941,0.353551,0.240826,-0.504468,-0.076584
4,0.426213,0.972151,0.267802,-0.935968,-0.497786,-1.347166,-0.814797,0.653700
5,0.887645,-0.022290,0.432730,-1.007823,-0.765956,-1.078591,0.391777,1.165134
6,0.064518,0.099956,-0.536865,0.190905,-0.198003,0.608922,0.448362,-0.016563
7,-0.775208,-0.626188,-0.017017,-0.517651,1.254164,1.165479,-0.670216,0.072592
8,-0.336761,0.437294,0.993767,-1.310215,-0.354914,0.613335,-0.972463,0.106919
9,-0.756114,-0.066526,-0.353885,1.373431,0.951132,0.420560,0.217300,1.171311

<mark>打印 df3 的前 5 行

In [36]:
df3.head()

,A,B,C,D,E,F,G,H
0,0.712962,0.728432,-0.590125,-0.093031,-0.917682,-0.500919,-0.116574,0.388894
1,-0.779034,0.152999,-0.222855,1.087092,-2.326493,0.952445,-1.138827,-0.745230
2,0.546075,0.017931,0.568044,0.682892,-0.409111,1.247741,-0.264636,-0.824967
3,0.580442,-0.718095,-0.115539,-0.729941,0.353551,0.240826,-0.504468,-0.076584
4,0.426213,0.972151,0.267802,-0.935968,-0.497786,-1.347166,-0.814797,0.653700

<mark>查看 df3 的描述性统计

In [37]:
df3.describe()

,A,B,C,D,E,F,G,H
count,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000
mean,0.057074,0.097567,0.042606,-0.126031,-0.291110,0.232263,-0.342454,0.189521
std,0.664793,0.528955,0.513818,0.932730,1.009778,0.912497,0.569873,0.683753
min,-0.779034,-0.718095,-0.590125,-1.310215,-2.326493,-1.347166,-1.138827,-0.824967
25%,-0.651275,-0.055467,-0.321127,-0.884462,-0.698914,-0.315483,-0.778652,-0.061578
50%,0.245365,0.058944,-0.066278,-0.305341,-0.382012,0.514741,-0.384552,0.089756
75%,0.571850,0.366220,0.391498,0.559895,0.215663,0.867667,0.133831,0.587498
max,0.887645,0.972151,0.993767,1.373431,1.254164,1.247741,0.448362,1.171311

<mark>将 df3 按照 A 列数值从小到大排序（只展示前 5 行）

In [38]:
df3.sort_values(by='A').head()

,A,B,C,D,E,F,G,H
1,-0.779034,0.152999,-0.222855,1.087092,-2.326493,0.952445,-1.138827,-0.745230
7,-0.775208,-0.626188,-0.017017,-0.517651,1.254164,1.165479,-0.670216,0.072592
9,-0.756114,-0.066526,-0.353885,1.373431,0.951132,0.420560,0.217300,1.171311
8,-0.336761,0.437294,0.993767,-1.310215,-0.354914,0.613335,-0.972463,0.106919
6,0.064518,0.099956,-0.536865,0.190905,-0.198003,0.608922,0.448362,-0.016563

<mark>打印 df3 的 C,H 列（只展示前 5 行）

In [39]:
df3.loc[0:4,['C','H']]

          C         H
0 -0.590125  0.388894
1 -0.222855 -0.745230
2  0.568044 -0.824967
3 -0.115539 -0.076584
4  0.267802  0.653700

In [40]:
df3.iloc[0:5,[2,7]]

          C         H
0 -0.590125  0.388894
1 -0.222855 -0.745230
2  0.568044 -0.824967
3 -0.115539 -0.076584
4  0.267802  0.653700

<mark>打印 df3 的 C 至 H 列（只展示前 5 行）

In [41]:
df3.loc[0:4,'C':'H']

          C         D         E         F         G         H
0 -0.590125 -0.093031 -0.917682 -0.500919 -0.116574  0.388894
1 -0.222855  1.087092 -2.326493  0.952445 -1.138827 -0.745230
2  0.568044  0.682892 -0.409111  1.247741 -0.264636 -0.824967
3 -0.115539 -0.729941  0.353551  0.240826 -0.504468 -0.076584
4  0.267802 -0.935968 -0.497786 -1.347166 -0.814797  0.653700

In [42]:
df3.iloc[0:5,2:]

          C         D         E         F         G         H
0 -0.590125 -0.093031 -0.917682 -0.500919 -0.116574  0.388894
1 -0.222855  1.087092 -2.326493  0.952445 -1.138827 -0.745230
2  0.568044  0.682892 -0.409111  1.247741 -0.264636 -0.824967
3 -0.115539 -0.729941  0.353551  0.240826 -0.504468 -0.076584
4  0.267802 -0.935968 -0.497786 -1.347166 -0.814797  0.653700

<mark>打印 df3 的 6,9 行

In [43]:
df3.loc[[5,8]]

,A,B,C,D,E,F,G,H
5,0.887645,-0.022290,0.432730,-1.007823,-0.765956,-1.078591,0.391777,1.165134
8,-0.336761,0.437294,0.993767,-1.310215,-0.354914,0.613335,-0.972463,0.106919

In [44]:
df3.iloc[[5,8]]

,A,B,C,D,E,F,G,H
5,0.887645,-0.022290,0.432730,-1.007823,-0.765956,-1.078591,0.391777,1.165134
8,-0.336761,0.437294,0.993767,-1.310215,-0.354914,0.613335,-0.972463,0.106919

<mark>打印 df3 的 6 至 9 行（不含）

In [45]:
df3.iloc[5:8]#注意为左闭右开区间

,A,B,C,D,E,F,G,H
5,0.887645,-0.022290,0.432730,-1.007823,-0.765956,-1.078591,0.391777,1.165134
6,0.064518,0.099956,-0.536865,0.190905,-0.198003,0.608922,0.448362,-0.016563
7,-0.775208,-0.626188,-0.017017,-0.517651,1.254164,1.165479,-0.670216,0.072592

In [46]:
df3.loc[5:7]#注意为闭区间

,A,B,C,D,E,F,G,H
5,0.887645,-0.022290,0.432730,-1.007823,-0.765956,-1.078591,0.391777,1.165134
6,0.064518,0.099956,-0.536865,0.190905,-0.198003,0.608922,0.448362,-0.016563
7,-0.775208,-0.626188,-0.017017,-0.517651,1.254164,1.165479,-0.670216,0.072592

<mark>打印 df3 的 6 至 9 行（不含）的 C 至 H 列

In [47]:
df3.iloc[5:8,2:]

          C         D         E         F         G         H
5  0.432730 -1.007823 -0.765956 -1.078591  0.391777  1.165134
6 -0.536865  0.190905 -0.198003  0.608922  0.448362 -0.016563
7 -0.017017 -0.517651  1.254164  1.165479 -0.670216  0.072592

In [48]:
df3.loc[5:7,'C':'H']

          C         D         E         F         G         H
5  0.432730 -1.007823 -0.765956 -1.078591  0.391777  1.165134
6 -0.536865  0.190905 -0.198003  0.608922  0.448362 -0.016563
7 -0.017017 -0.517651  1.254164  1.165479 -0.670216  0.072592

<mark>打印 df3 的 6,9 行的 C,H 列

In [49]:
df3.loc[[5,8],['C','H']]

          C         H
5  0.432730  1.165134
8  0.993767  0.106919

In [50]:
df3.iloc[[5,8],[2,7]]

          C         H
5  0.432730  1.165134
8  0.993767  0.106919

<mark><font color=red size=4 face=雅黑>题目要求中行列号到底是从0还是1开始？上面写的都是从1开始的，看下面从0列开始的尿性，应该都是从0开始。之前的懒得改了，阅读代码的时候要从这里开始注意一下，以下行列号都是从0开始。

<mark>iloc - 仿照示例使用 iloc 获取 df 的 1 行至 4 行（不含）的 0 列至 3 列（不含）

In [51]:
df3.iloc[1:4,0:3]

          A         B         C
1 -0.779034  0.152999 -0.222855
2  0.546075  0.017931  0.568044
3  0.580442 -0.718095 -0.115539

<mark>iloc - 仿照示例使用 iloc 获取 df 的 1 行、 4 行的 0 列、 3 列

In [52]:
df3.iloc[[1,4],[0,3]]

          A         D
1 -0.779034  1.087092
4  0.426213 -0.935968

<mark>iloc - 仿照示例使用 iloc 获取 df 的 1 至 4 行（不含）

In [53]:
df3.iloc[1:4]

,A,B,C,D,E,F,G,H
1,-0.779034,0.152999,-0.222855,1.087092,-2.326493,0.952445,-1.138827,-0.745230
2,0.546075,0.017931,0.568044,0.682892,-0.409111,1.247741,-0.264636,-0.824967
3,0.580442,-0.718095,-0.115539,-0.729941,0.353551,0.240826,-0.504468,-0.076584

<mark>iloc - 仿照示例使用 iloc 获取 df 的 2 行 2 列

In [54]:
df3.iloc[2,2]

0.5680438980348024

<mark>iat - 仿照示例使用 iat 获取 df 的 2 行 2 列

In [55]:
df3.iat[2,2]

0.5680438980348024

<mark>仿照示例选取 df 中 A 列大于 0.5 的部分

In [56]:
df3[df3.A>.5]

,A,B,C,D,E,F,G,H
0,0.712962,0.728432,-0.590125,-0.093031,-0.917682,-0.500919,-0.116574,0.388894
2,0.546075,0.017931,0.568044,0.682892,-0.409111,1.247741,-0.264636,-0.824967
3,0.580442,-0.718095,-0.115539,-0.729941,0.353551,0.240826,-0.504468,-0.076584
5,0.887645,-0.022290,0.432730,-1.007823,-0.765956,-1.078591,0.391777,1.165134

<mark>仿照示例选取 df 中所有小于 0.5 的部分

In [57]:
df3[df3<.5]

,A,B,C,D,E,F,G,H
0,NaN,NaN,-0.590125,-0.093031,-0.917682,-0.500919,-0.116574,0.388894
1,-0.779034,0.152999,-0.222855,NaN,-2.326493,NaN,-1.138827,-0.745230
2,NaN,0.017931,NaN,NaN,-0.409111,NaN,-0.264636,-0.824967
3,NaN,-0.718095,-0.115539,-0.729941,0.353551,0.240826,-0.504468,-0.076584
4,0.426213,NaN,0.267802,-0.935968,-0.497786,-1.347166,-0.814797,NaN
5,NaN,-0.022290,0.432730,-1.007823,-0.765956,-1.078591,0.391777,NaN
6,0.064518,0.099956,-0.536865,0.190905,-0.198003,NaN,0.448362,-0.016563
7,-0.775208,-0.626188,-0.017017,-0.517651,NaN,NaN,-0.670216,0.072592
8,-0.336761,0.437294,NaN,-1.310215,-0.354914,NaN,-0.972463,0.106919
9,-0.756114,-0.066526,-0.353885,NaN,NaN,0.420560,0.217300,NaN

<mark><font color=red size=4 face=雅黑>从下面代码块开始，df、df2均被覆盖

<mark>创建 df :
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [58]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.952330  1.234955 -0.331372 -0.360182
2013-01-02  0.238273 -0.965770  0.848247 -0.346107
2013-01-03 -1.309907 -0.275858 -1.119454 -0.540678
2013-01-04 -1.265385  0.854334  0.418519  1.110354
2013-01-05 -1.474548 -1.379693  0.126495 -0.924273
2013-01-06 -0.993208  0.424838 -0.344419 -0.973588

<mark>copy - 按照示例复制 df 并命名为 df2

In [59]:
df2=df.copy()#deep=True (default)，a new object will be created，deep=False的时候就相当于df2=df，是引用而不是deep copy
df2

                   A         B         C         D
2013-01-01  0.952330  1.234955 -0.331372 -0.360182
2013-01-02  0.238273 -0.965770  0.848247 -0.346107
2013-01-03 -1.309907 -0.275858 -1.119454 -0.540678
2013-01-04 -1.265385  0.854334  0.418519  1.110354
2013-01-05 -1.474548 -1.379693  0.126495 -0.924273
2013-01-06 -0.993208  0.424838 -0.344419 -0.973588

<mark>仿照示例创建 df2 的 E 列，值为 ['T', 'O', 'T', 'T', 'D', 'U']

In [60]:
df2['E'] = ['T', 'O', 'T', 'T', 'D', 'U']#没有的时候是创建，有的时候是赋值
df2

                   A         B         C         D  E
2013-01-01  0.952330  1.234955 -0.331372 -0.360182  T
2013-01-02  0.238273 -0.965770  0.848247 -0.346107  O
2013-01-03 -1.309907 -0.275858 -1.119454 -0.540678  T
2013-01-04 -1.265385  0.854334  0.418519  1.110354  T
2013-01-05 -1.474548 -1.379693  0.126495 -0.924273  D
2013-01-06 -0.993208  0.424838 -0.344419 -0.973588  U

<mark>isin - 仿照示例选取 df2 中 E 列值为 T,D,U 的部分

In [61]:
df2[df2.E.isin(['T','D','U'])]

                   A         B         C         D  E
2013-01-01  0.952330  1.234955 -0.331372 -0.360182  T
2013-01-03 -1.309907 -0.275858 -1.119454 -0.540678  T
2013-01-04 -1.265385  0.854334  0.418519  1.110354  T
2013-01-05 -1.474548 -1.379693  0.126495 -0.924273  D
2013-01-06 -0.993208  0.424838 -0.344419 -0.973588  U

<mark>仿照示例创建 s1，长度为 7，数值任意，其中 index 为 20200206 起的 7 天

In [62]:
s1 = pd.Series(list(range(1,8)), index=pd.date_range('20200206', periods=7))#list(range(1,8))==[1, 2, 3, 4, 5, 6,7]
s1

2020-02-06    1
2020-02-07    2
2020-02-08    3
2020-02-09    4
2020-02-10    5
2020-02-11    6
2020-02-12    7
Freq: D, dtype: int64

<mark>at - 仿照示例将 df 的 0 行 B 列赋值为 0

In [63]:
df

                   A         B         C         D
2013-01-01  0.952330  1.234955 -0.331372 -0.360182
2013-01-02  0.238273 -0.965770  0.848247 -0.346107
2013-01-03 -1.309907 -0.275858 -1.119454 -0.540678
2013-01-04 -1.265385  0.854334  0.418519  1.110354
2013-01-05 -1.474548 -1.379693  0.126495 -0.924273
2013-01-06 -0.993208  0.424838 -0.344419 -0.973588

In [64]:
df.at['20130101','B']=0
df

                   A         B         C         D
2013-01-01  0.952330  0.000000 -0.331372 -0.360182
2013-01-02  0.238273 -0.965770  0.848247 -0.346107
2013-01-03 -1.309907 -0.275858 -1.119454 -0.540678
2013-01-04 -1.265385  0.854334  0.418519  1.110354
2013-01-05 -1.474548 -1.379693  0.126495 -0.924273
2013-01-06 -0.993208  0.424838 -0.344419 -0.973588

<mark>iat - 仿照示例将 df 的 0 行 0 列赋值为 0

In [65]:
df.iat[0,0]=0
df

                   A         B         C         D
2013-01-01  0.000000  0.000000 -0.331372 -0.360182
2013-01-02  0.238273 -0.965770  0.848247 -0.346107
2013-01-03 -1.309907 -0.275858 -1.119454 -0.540678
2013-01-04 -1.265385  0.854334  0.418519  1.110354
2013-01-05 -1.474548 -1.379693  0.126495 -0.924273
2013-01-06 -0.993208  0.424838 -0.344419 -0.973588

<mark>将 df 的 D 列均赋值为 5

In [66]:
df.D=5
df.loc[:,'D']=5#效果同上，逗号前面的冒号不能省略
df.loc[:,'D']=np.array([5] * len(df))#效果同上
df

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.331372  5
2013-01-02  0.238273 -0.965770  0.848247  5
2013-01-03 -1.309907 -0.275858 -1.119454  5
2013-01-04 -1.265385  0.854334  0.418519  5
2013-01-05 -1.474548 -1.379693  0.126495  5
2013-01-06 -0.993208  0.424838 -0.344419  5

<mark>仿照示例将 df 中数值为 5 的赋值为其相反数

In [67]:
df[df==5]=-df
df

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.331372 -5
2013-01-02  0.238273 -0.965770  0.848247 -5
2013-01-03 -1.309907 -0.275858 -1.119454 -5
2013-01-04 -1.265385  0.854334  0.418519 -5
2013-01-05 -1.474548 -1.379693  0.126495 -5
2013-01-06 -0.993208  0.424838 -0.344419 -5

<mark>按照示例创建 df1

In [68]:
#Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])#
df1

                   A         B         C  D   E
2013-01-01  0.000000  0.000000 -0.331372 -5 NaN
2013-01-02  0.238273 -0.965770  0.848247 -5 NaN
2013-01-03 -1.309907 -0.275858 -1.119454 -5 NaN
2013-01-04 -1.265385  0.854334  0.418519 -5 NaN

<mark>按照示例给 E 列 0,1 行赋值为 1

In [69]:
df1.iloc[[0,1],4]=1#等同于：df1.loc[dates[0]:dates[1], 'E'] = 1或df1.iloc[0:2,4]
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.331372 -5  1.0
2013-01-02  0.238273 -0.965770  0.848247 -5  1.0
2013-01-03 -1.309907 -0.275858 -1.119454 -5  NaN
2013-01-04 -1.265385  0.854334  0.418519 -5  NaN

<mark>dropna - 按照示例对 df1 去除所有含有空值的行

In [70]:
#默认返回副本，不改变原dataframe
#inplacebool, default False，If True, do operation inplace and return None.
#how{‘any’, ‘all’}, default ‘any’
df1.dropna(how='any')
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.331372 -5  1.0
2013-01-02  0.238273 -0.965770  0.848247 -5  1.0
2013-01-03 -1.309907 -0.275858 -1.119454 -5  NaN
2013-01-04 -1.265385  0.854334  0.418519 -5  NaN

<mark>fillna - 按照示例将 df1 中所有空值用数值 5 填充

In [71]:
#默认返回副本，不改变原dataframe
#inplacebool, default False，If True, do operation inplace and return None.
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.331372 -5  1.0
2013-01-02  0.238273 -0.965770  0.848247 -5  1.0
2013-01-03 -1.309907 -0.275858 -1.119454 -5  5.0
2013-01-04 -1.265385  0.854334  0.418519 -5  5.0

<mark>isna - 按照示例判断 df1 中每个值是否为空值

In [72]:
df1.isna()

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

<mark>mean - 按照示例计算 df 每一列的平均值

In [73]:
df.mean()

A   -0.800796
B   -0.223692
C   -0.066997
D   -5.000000
dtype: float64

<mark>mean - 按照示例计算 df 每一行的平均值

In [74]:
df.mean(1)

2013-01-01   -1.332843
2013-01-02   -1.219812
2013-01-03   -1.926305
2013-01-04   -1.248133
2013-01-05   -1.931936
2013-01-06   -1.478197
Freq: D, dtype: float64

<mark>shift - 按照示例创建 s 并后移 2 行

In [75]:
#shift(periods=1, freq改变的是时间索引（如果有）=None, axis=0, fill_value=None)
#freq改变的是时间索引（如果有）
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

<mark>sub - 按照示例将 df 每一列与 s 相减

In [76]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.331372 -5
2013-01-02  0.238273 -0.965770  0.848247 -5
2013-01-03 -1.309907 -0.275858 -1.119454 -5
2013-01-04 -1.265385  0.854334  0.418519 -5
2013-01-05 -1.474548 -1.379693  0.126495 -5
2013-01-06 -0.993208  0.424838 -0.344419 -5

In [77]:
df.sub(s, axis='index')

                   A         B         C     D
2013-01-01       NaN       NaN       NaN   NaN
2013-01-02       NaN       NaN       NaN   NaN
2013-01-03 -2.309907 -1.275858 -2.119454  -6.0
2013-01-04 -4.265385 -2.145666 -2.581481  -8.0
2013-01-05 -6.474548 -6.379693 -4.873505 -10.0
2013-01-06       NaN       NaN       NaN   NaN

<mark>apply & cumsum - 按照示例对 df 每一列执行累加

In [78]:
#axis{0 or ‘index’, 1 or ‘columns’}, default 0
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000  0.000000 -0.331372  -5
2013-01-02  0.238273 -0.965770  0.516876 -10
2013-01-03 -1.071634 -1.241629 -0.602578 -15
2013-01-04 -2.337019 -0.387295 -0.184060 -20
2013-01-05 -3.811567 -1.766987 -0.057564 -25
2013-01-06 -4.804775 -1.342150 -0.401983 -30

<mark>apply & cumsum - 仿照示例对 df 每一行执行累加

In [79]:
df.apply(np.cumsum,axis=1)

                   A         B         C         D
2013-01-01  0.000000  0.000000 -0.331372 -5.331372
2013-01-02  0.238273 -0.727497  0.120750 -4.879250
2013-01-03 -1.309907 -1.585766 -2.705220 -7.705220
2013-01-04 -1.265385 -0.411051  0.007468 -4.992532
2013-01-05 -1.474548 -2.854241 -2.727746 -7.727746
2013-01-06 -0.993208 -0.568370 -0.912789 -5.912789

<mark>apply & lambda - 按照示例对 df 每一列求极差

In [80]:
df.apply(lambda x: x.max() - x.min())#关注lambda函数，关注axis代表的意义

A    1.712821
B    2.234027
C    1.967701
D    0.000000
dtype: float64

<mark>按照示例创建 s

In [81]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    3
1    4
2    3
3    5
4    2
5    3
6    2
7    0
8    2
9    5
dtype: int32

<mark>value_counts - 统计 s 中各个数值出现的频次

In [82]:
s.value_counts()

3    3
2    3
5    2
4    1
0    1
dtype: int64

<mark>按照示例创建 s

In [83]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

<mark>str.lower - 按照示例将 s 中元素的字母都变为小写

In [84]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

<mark>str.upper - 仿照示例将 s 中元素的字母都变为大写

In [85]:
s.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
dtype: object

<mark>str.capitalize - 仿照示例将 s 中元素的首字母变为大写

In [86]:
s.str.capitalize()

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    Caba
7     Dog
8     Cat
dtype: object